Fix mermaid diagram
